{
  "Преимущества": "Advantages",
  "Возможности": "Capabilities",
  "Промышленные роботы": "Industrial Robots",
  "Производство": "Manufacturing",
  "Контакты": "Contacts",

  "ИРТ": "SRT",
  " — роботизированные технологии для автоматизации вашего производства": " — robotic technologies for automating your production",
  "Раздвигаем границы возможного!": "Expanding the Boundaries of Possibility!",

  "Наши преимущества": "Our Advantages",
  "ИРТ выведет ваше производство на новый уровень рентабельности и качества.": "SRT will elevate your production to a new level of profitability and quality.",
  "Гибкость использования": "Flexibility of Use",
  "Наши технологии применимы в самых разных сферах — от электроники и фармацевтики до тяжелой промышленности. Мы обеспечиваем быстрое внедрение и адаптацию под ваши потребности, сохраняя высочайшее качество производства.": "Our technologies are applicable in various fields, from electronics and pharmaceuticals to heavy industry. We ensure rapid implementation and customization to your needs while maintaining the highest production quality.",
  "Производительность": "Performance",
  "Наши технологии круглосуточно выполняют поставленные задачи с высоким уровнем точности и стабильности. Им не нужен отпуск или выходной.": "Our technologies operate around the clock, executing assigned tasks with high precision and stability. They don’t require vacations or days off.",
  "Рентабельность": "Cost-Effectiveness",
  "Сокращение затрат на персонал и его обучение, а также снижение внепроизводственные расходов, увеличение объема и качества выпускаемой продукции.": "Reduce labor costs and training expenses while cutting non-production costs. Increase the volume and quality of manufactured products.",
  "Независимость от кадров": "Independence from Personnel",
  "Наши технологии позволяют поддерживать стабильность производства даже при нехватке или отсутствии высококвалифицированного персонала.": "Our technologies ensure production stability, even in the absence or shortage of highly qualified personnel.",
  
  "Наши возможности": "Our Capabilities",
  "Промышленные роботы манипуляторы": "Industrial Robotic Arms",
  "Программирование и пуско-наладка": "Programming and commissioning.",
  "Интеллектуальные разработки": "Intelligent Solutions",
  "Мы сможем не только поставить необходимых роботов, но и спроектировать все узлы и компоненты для интеграции в ваш рабочий процесс": "We not only supply the necessary robots but also design all nodes and components for seamless integration into your workflow.",
  "Собственное производство": "In-House Manufacturing",
  "Изготовление необходимой оснастки и инструментов на собственном производстве": "Production of necessary tooling and instruments at our own facilities.",
  "Написание управляющих программ для оборудования": "Development of Control Programs for equipment.",
  "Написание постпроцессоров": "Post-Processor Development",
  "Программирование контроллеров": "Controller Programming",
  "Автоматизация технологических процессов": "Automation of Technological Processes",
  "3D-моделирование и разработка чертежей": "3D Modeling and Drawing Development",
  "Модернизация оборудования": "Equipment Modernization",

  "Мы предлагаем обширный ассортимент промышленных роботов-манипуляторов, обеспечиваем их интеграцию в производственный процесс, выполняем программирование, изготовление необходимого оборудования и оснастки, а также предоставляем всестороннюю техническую и программную поддержку.": "We offer a wide range of industrial robotic arms, ensuring their integration into your production process. We provide programming, production of necessary equipment and tooling, and comprehensive technical and software support.",
  "Роботы SCARA": "SCARA Robots",
  "Компактная конструкция, высокая скорость, высокая точность позиционирования, малый размер и гибкость, защита от воды и пыли, легкий корпус, Поддержка модуля Wi-Fi, загрузка и выгрузка данных, мониторинг в реальном времени.": "Compact design, high speed, high positioning accuracy. Small size and flexibility. Water- and dust-resistant. Lightweight body, Wi-Fi module support, data upload and download, real-time monitoring.",
  "Компьютерная, производство электроники, сортировка, фармацевтическое производство, пищевая промышленность.": "Computers, electronics manufacturing, sorting, pharmaceutical production, food industry.",
  "Модель": "Model",
  "Радиус действия, мм": "Reach, mm",
  "Полезная нагрузка, кг": "Payload, kg",
  "Количество осей": "Number of Axes",
  "Настольные роботы серии SRTt": "SRTt Desktop Robots",
  "Высокий уровень защиты, высокая скорость, точность, стабильность.": "High protection level, high speed, accuracy, and stability.",
  "Компьютерная, коммуникационная, бытовая электроника, металлообработка, пищевая промышленность, фармацевтическое производство. Идеально подходит для интенсивной работы в зоне замкнутого пространства.": "Computers, communication, consumer electronics, metalworking, food industry, pharmaceutical production. Ideal for intensive operation in confined spaces.",
  "Роботы легко - средне нагруженные SRTе": "SRTе Light-to-Medium Load Robots",
  "Высокая скорость, повторяемость, точность позиционирования и жесткость, высокий уровень защиты, легкий корпус, низкие затраты на эксплуатацию и обслуживание.": "High speed, repeatability, positioning accuracy, and rigidity. High protection level, lightweight body, low operating and maintenance costs.",
  "Компьютерная, коммуникационная, производство бытовой электроники, металлообработка, сварочное производство, окрасочное производство. В основном применяется для погрузки и разгрузки, шлифовки и полировки, сварки, перемещения и укладки в тяжелых условиях.": "Computers, communication, consumer electronics manufacturing, metalworking, welding, painting. Primarily used for loading/unloading, grinding/polishing, welding, transferring, and stacking under harsh conditions.",
  "Роботы тяжело нагруженные SRTh": "SRTh Heavy-Duty Robots",
  "Жёсткая конструкция, высокая стабильность, незначительные колебания крутящего момента.": "Rigid structure, high stability, minimal torque fluctuations.",
  "Производственные линии, тяжелая промышленность, машиностроение, механическая обработка, перемещение тяжелых грузов.": "Production lines, heavy industry, mechanical engineering, machining, handling heavy loads.",
  "Область применения:": "Applications:",
  "Основные технические характеристики": "Key Technical Specifications",

  "companyText": "Our company is part of {companyLink}",
  "companyName": "\"Volga Production Association №3\", LLC",
  "— это стабильно работающее предприятие с парком современного высокотехнологичного оборудования, что позволяет нам выпускать продукцию высокого качества, соответствующую самым строгим требованиям заказчиков.": "It is a stable enterprise equipped with a fleet of modern high-tech machinery, enabling us to produce high-quality products that meet the most stringent customer requirements.",
  "Мы гордимся своей профессиональной командой, состоящей из опытных рабочих, инженеров и программистов. Наши специалисты оперативно решают сложные производственные задачи и предоставляют услуги по созданию оснастки и компонентов для проектов автоматизации и роботизации технологических процессов.": "We take pride in our professional team, which includes experienced workers, engineers, and programmers. Our specialists efficiently solve complex production challenges and provide services for the creation of tooling and components for automation and robotics projects.",
  "Преимущества автоматизации технологических процессов": "Advantages of Automating Technological Processes",
  "• Контролирование процесса удаленно, с любого устройства.": "• Remote process monitoring from any device.",
  "• Все параметры регулируются автоматически, исключая человеческий фактор.": "• Automatic parameter adjustment, eliminating human error.",
  "• Увеличение производительности и отсутствие необходимости постоянного присутствия оператора.": "• Increased productivity and no need for constant operator presence.",
  "Обычный сушильный шкаф, приобретенный у отечественного производителя, с ручным управлением оказался неудобным и малоэффективным: для настройки режимов требовалось постоянное присутствие оператора, что снижало производительность и рентабельность.": "A conventional drying cabinet purchased from a domestic manufacturer with manual control proved to be inconvenient and inefficient: setting the modes required constant operator presence, which reduced productivity and profitability.",
  "После нашей модернизации и интеграции системы управления процессором необходимость в постоянном присутствии персонала отпала. Единственное участие человека сводится к загрузке и выгрузке, что требуется лишь раз в четыре дня.": "After our modernization and integration of a processor-based control system, the need for constant personnel presence was eliminated. Human involvement is now limited to loading and unloading, which is required only once every four days.",
  "Возможность удалённо регулировать температурные и временные режимы с любого устройства. Программное обеспечение, разработанное нашими инженерами, позволяет гибко задавать любые режимы и циклы, а также защищает от нештатных ситуаций. В случае аварии система автоматически оповестит вас сигналом или сообщением.": "The system allows remote adjustment of temperature and time settings from any device. Software developed by our engineers enables flexible programming of any modes and cycles, while also providing protection against unforeseen situations. In the event of an emergency, the system will automatically notify you via signal or message.",
  "Как пример:": "For example:",
  " в процессе, длительностью 4 суток, каждые 1,5 часа требуется повышать температуру на 7 градусов. При нарушении этих условий продукция становится испорченной. Благодаря нашей автоматизации весь процесс выполняется без сбоев, полностью в автоматическом режиме.": " in a process lasting 4 days, the temperature needs to be increased by 7°C every 1.5 hours. Failure to meet these conditions results in spoiled products. Thanks to our automation, the entire process runs seamlessly and fully automatically.",
  "Модернизация горизонтально-расточного станка 2А622Ф4": "Modernization of Horizontal Boring Machine 2А622Ф4",
  "Заказчик столкнулся с проблемой частого выхода из строя громоздких и не очень надежных двигателей постоянного тока Болгарского производства на горизонтально-расточном станке 2А622Ф4.": "The customer faced frequent breakdowns of bulky and unreliable Bulgarian-made DC motors on the horizontal boring machine 2А622Ф4.",
  "Были спроектированы и изготовлены на собственном производстве переходной адаптер, детали сильфонной муфты и другие необходимые крепежные элементы. После тестирования станок был успешно сдан заказчику, который планирует по этой же схеме поменять все остальные двигатели!": "We designed and manufactured an adapter, bellows coupling components, and other necessary fasteners at our facilities. After testing, the machine was successfully delivered to the customer, who plans to replace all remaining motors similarly!",
  
  "Присоединяйтесь к нам!": "Join Us!",
  "Мы предлагаем сотрудничество специалистам, которые хотят расти и развиваться в области цифровых технологий. Если у вас есть знания и амбиции, независимо от вашего местоположения, мы будем рады видеть вас в нашей команде. Мы предлагаем возможности для обучения, развития и достойного заработка.": "We offer opportunities for specialists eager to grow and develop in digital technologies. Regardless of your location, if you have the knowledge and ambition, we’d be delighted to have you on our team. We provide opportunities for training, development, and competitive compensation.",
  "Мы готовы к сотрудничеству с региональными компаниями для реализации проектов и решения актуальных задач на местах.": "We are open to collaborating with regional companies to implement projects and solve pressing local challenges.",
  
  "Подробнее": "More",
  "Скрыть": "Less"
}
